{
    "Summary": "I am Aditya Neema, currently pursuing a Bachelor's degree in Computer Science at SRM University, with a GPA of 8.51. I\nprioritize academic excellence and have a strong passion for frontend development. Through various projects and\ninternships, I have developed and refined my skills. My goal is to integrate technical expertise with social responsibility,\nembrace new challenges, and seek opportunities for collaborative growth.",
    "Education": [
        "SRM Institute of Science and Technology, Kattankulathur Sep 2021 - Present\nB.Tech Â· Computer Science Â· Chennai CGPA-8.51/10\nModern International School Apr 2020 - Jul 2021\n12th Â· CBSE Â· Indore Percentage-82.80/100\nNew Digamber Public School Apr 2018 - May 2019\n10th Â· CBSE Â· Indore Percentage-92.40/100"
    ],
    "Skills": "Python, C, C++, Java, CSS, JavaScript, MySQL, UI/UX, HTML, Project Management, Figma, Git, Github, Bootstrap,\nBootstrap, Adobe Photoshop, OOPS, DBMS, ReactJS",
    "Experience": [
        "CodeAlpha | Link Mar 2024 - Apr 2024\nÂ· Web Developer Â· Internship Virtual\nEngaged in collaborative projects focused on creating user-centric interfaces, integrating responsive design, and improving\nwebsite performance. Developed expertise in HTML, CSS, JavaScript, and Node.js through practical application and\nindustry standards. Gained hands-on experience addressing real-world challenges, ensuring high-quality digital solutions\nBharat Intern | Link Jan 2024 - Feb 2024\nÂ· Full Stack Web Developer Â· Internship Virtual\nEngaged in the Bharat Intern internship program as a full stack developer, gaining practical experience with HTML, CSS,\nMongoDB, Node.js, and JavaScript. Developed skills in building robust web applications and implementing database\nsolutions. Applied learned concepts to deliver efficient and scalable digital solutions.\nBootNext Tech Venture Private Limited | Link Jul 2023 - Jul 2023\nÂ· UI/UX Developer Â· Internship Indore\nInterned at BootNext Tech Venture as a UI-UX developer, acquiring skills in prototyping, Figma proficiency, wireframing,\nlayout design, and user research. Applied these skills to contribute to UI design projects, gaining practical experience in\ncreating intuitive and user-friendly digital interfaces aligned with industry standards."
    ],
    "Projects": [
        "Blog Website | Github Jan 2024 - Feb 2024\nÂ· HTML,CSS,JavaScript Web Developer\nDeveloped a feature-rich blog website using HTML, CSS, and JavaScript, enabling users to create, delete, and edit blog\nposts seamlessly. Implemented intuitive navigation, responsive design, and robust backend functionalities to enhance user\nexperience and content management efficiency.\nRegistration Form | Github Jan 2024 - Feb 2024\nÂ· HTML,CSS,JavaScript Web Development\nDeveloped a registration form website using HTML, CSS, and JavaScript, implementing functionalities for successful user\nlogin validation and error handling. Demonstrated proficiency in frontend development and problem-solving, ensuring a\nseamless user experience through effective design and functionality.\nPortfolio Website | Github -\nÂ· HTML,CSS,JavaScript Web Developer\nI designed and developed a personalized portfolio website using JavaScript, HTML, and CSS to showcase my skills,\nprojects, and achievements. The website features a modern, responsive layout aimed at highlighting my proficiency in\nfrontend development and creating an engaging user experience.\nSocial Media Tracker Dashboard | Github Mar 2024 - Mar 2024\nÂ· HTML,CSS,JavaScript Web Developer\nCreated a social media dashboard using HTML, CSS, and JavaScript to analyze various social media handles. Implemented\nfeatures for comprehensive analytics, showcasing proficiency in frontend development and data visualization. Designed to\nprovide actionable insights for effective social media management\nAttendance Management System Using Facial Recognition Jun 2023 - Dec 2023\nÂ· Python,OpenCV,HTML,CSS,JavaScript Machine Learning\nDesigned an advanced attendance management system using facial recognition technology with Python, OpenCV, HTML,\nand CSS. Integrated real-time facial detection and recognition capabilities for accurate attendance tracking. Implemented\na user-friendly interface with responsive design, ensuring efficient and secure management of attendance records.\nLibrary Management System Jan 2023 - Jun 2023\nÂ· C,C++ Object Oriented Programming\nDeveloped a library management system using object-oriented programming principles, ensuring efficient cataloging,\nborrowing, and returning of books. Implemented with Java or Python, the system streamlined library operations,\ndemonstrating proficiency in software design and enhancing user experience through intuitive functionality.\n3.5"
    ],
    "Certifications": [
        "Oracle Cloud Infrastructure 2023 Certified Foundations Associate |\nCertificate\nJul 2024 - Present\nOracle Â· 100706012OCIF2023CA\nWelcome To ServiceNow -Micro Certification Jun 2024 -\nServiceNow\nMETA Frontend Developer May 2023 -\nCoursera\nFinancial Markets-By Yale University May 2024 -\nCoursera\nAI-ML Virtual Internship Program Nov 2023 -\nAICTE Â· :f2ec6718cfdd4ca1e7f36889c5f391b1\nNetworking Basics Apr 2023 -\nCisco\nAWS Academy Cloud Foundations Jul 2023 -\nAWS"
    ],
    "Conferences and Workshops": [
        "MERN Full Stack Development Workshop | Certificate Aug 2023\nDepartment of Data Science and Business System Â· SRM Institute of Science and\nTechnology\nUI/UX Masterclass | Certificate Aug 2023\nTeam Gen-Y Â· SRM Institute of Science and Technology\nProof of Community- Shardeum | Certificate Jan 2023\nDS Community Â· SRM Institute of Science and Technology"
    ],
    "Scholarships": [
        "COSMIC 365 Internship Program Jul 2024\nCOSMIC 365\nCurrently engaged in a $600 internship program, gaining hands-on industry experience and refining technical skills.\nApplying academic knowledge in a professional environment, contributing to ongoing project success.\nVolunteering\nAARUSH -\nVolunteer\nVolunteered at Aarush, a student-organized fest, contributing to event planning, coordination, and execution. Assisted in\nmanaging various activities, showcasing strong organizational and teamwork skills. Played a key role in ensuring the fest's\nsuccess through effective communication and problem-solving."
    ],
    "Languages": "English [Professional Working Proficiency], Hindi [Professional Working Proficiency]",
    "Links": "LinkedIn, GitHub, HackerRank"
}